; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(any-pickedup)
		(pickedup ?x)
	)
	
	; pickup the block ?x from the block ?y
	(:action pickup-from-block
		:parameters (?x ?y)
		:precondition
		(and
			(clear ?x)
			(on-top ?x ?y)
			(not (any-pickedup))
		)
		:effect
		(and
			(not (on-top ?x ?y))
			(clear ?y)
			(any-pickedup)
			(pickedup ?x)
		)
	)
	
	; pickup the block ?x from the floor
	(:action pickup-from-floor
		:parameters (?x)
		:precondition
		(and
			(clear ?x)
			(on-floor ?x)
			(not (any-pickedup))
		)
		:effect
		(and
			(not (on-floor ?x))
			(any-pickedup)
			(pickedup ?x)
		)
	)
	
	; putdown the block ?x to the block ?y
	(:action putdown-to-block
		:parameters (?y ?x)
		:precondition
		(and
			(clear ?x)
			(clear ?y)
			(pickedup ?x)
		)
		:effect
		(and
			(on-top ?x ?y)
			(not (clear ?y))
			(not (on-floor ?x))
			(not (any-pickedup))
			(not (pickedup ?x))
		)
	)
	
	; putdown the block ?x to the floor
	(:action putdown-to-floor
		:parameters (?x)
		:precondition
		(and
			(clear ?x)
			(pickedup ?x)
		)
		:effect
		(and
			(on-floor ?x)
			(not (any-pickedup))
			(not (pickedup ?x))
		)
	)
)

; problem
(define (problem p1)
	(:domain world-of-blocks)
	(:objects a b c d e)
	(:init
		(clear c)
		(on-top c b)
		(on-top b a)
		(on-floor a)
		
		(clear e)
		(on-top e d)
		(on-floor d)
	)
	(:goal
		(and
			(on-top d b)
		)
	)
)

; plan
1. (pickup-from-block c b)
   deleted: (on-top c b)
   added: (clear b) (any-pickedup) (pickedup c)
   goals met: 0 of 1
2. (putdown-to-floor c)
   deleted: (any-pickedup) (pickedup c)
   added: (on-floor c)
   goals met: 0 of 1
3. (pickup-from-block e d)
   deleted: (on-top e d)
   added: (clear d) (any-pickedup) (pickedup e)
   goals met: 0 of 1
4. (putdown-to-block c e)
   deleted: (clear c) (any-pickedup) (pickedup e)
   added: (on-top e c)
   goals met: 0 of 1
5. (pickup-from-floor d)
   deleted: (on-floor d)
   added: (any-pickedup) (pickedup d)
   goals met: 0 of 1
6. (putdown-to-block b d)
   deleted: (clear b) (any-pickedup) (pickedup d)
   added: (on-top d b)
   goals met: 1 of 1
